Reports/АнализУчетаНДСПриЗачетеАвансовПолученных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>АнализУчетаНДСПриЗачетеАвансовПолученных</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/НДСАвансыПолученные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>НДСАвансыПолученные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияНДСАвансы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗачетаАванса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентнаяОперация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеСчетФактураВыданныйАванс</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданныйАванс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СобытияНДСАвансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СобытияНДСАвансы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВычетСВыданногоАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеПриЗачетеАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеПриВозвратеАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСПолученногоАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВычетПриЗачетеАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВычетПриВозвратеАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНДССПолученногоАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносАванса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СчетФактураВыданныйАванс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СчетФактураВыданныйАванс</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеБезналичныхДенежныхСредств</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.СчетФактураПолученныйАванс</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПоНДС</xr:Item>
				<xr:Item>AccumulationRegister.НДСАвансыПолученные</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
				<xr:Item>InformationRegister.ЖурналУчетаСчетовФактур</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеСчетФактураВыданныйАванс</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежноРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежноРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПлатежноРасчетныеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыставленВЭлектронномВиде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОтбораАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактураОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданныйАванс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИНН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГосКонтракта</Name>
					<Comment>Идентификатор государственного контракта, договора (соглашения)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корректировочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СводныйКорректировочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировкаЖурналаСФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияАванса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Авансы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураНабора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНабора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗапасов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗапасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйСчетФактура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданныйАванс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыАвансовКомитента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйДокумент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеСчетФактураВыданныйАванс</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежноРасчетногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежноРасчетногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АнализУчетаНДСПриЗачетеАвансовПолученных/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПериодОтбора = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(
		КомпоновщикНастроек.ПользовательскиеНастройки, "ПериодОтбора").Значение; // СтандартныйПериод -
	Организация = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(
		КомпоновщикНастроек.ПользовательскиеНастройки, "Организация").Значение; // СправочникСсылка.Организации -
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация",   Организация);
	СтруктураПараметров.Вставить("ДатаНачала",    ПериодОтбора.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончания", ОбработаннаяДатаОкончания(ПериодОтбора.ДатаОкончания));
	
	СообщениеОЗакрытииМесяца = "";
	
	УстановитьПривилегированныйРежим(Истина);
	Если УчетНДСУПСлужебный.ПроверитьНаличиеЗаданий_ФормированияДвиженийПоНДС(СтруктураПараметров) Тогда
		СообщениеОЗакрытииМесяца = НСтр("ru = 'Необходимо выполнить регл. операцию
		|""Формирование движений по НДС"".'");
	КонецЕсли;
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,
		"СообщениеОЗакрытииМесяца",
		СообщениеОЗакрытииМесяца);
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	ВнешниеНаборыДанных = ПолучитьВнешниеНаборыДанных();
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ОбработаннаяДатаОкончания(знач ДатаОкончания)
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания        = Дата(3000, 1, 1);
	КонецЕсли;
	
	Возврат ДатаОкончания;
	
КонецФункции

Функция ПолучитьВнешниеНаборыДанных()
	
	СтруктураНаборовДанных = Новый Структура;
	
	ПериодОтбора = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(
		КомпоновщикНастроек.ПользовательскиеНастройки, "ПериодОтбора").Значение; // СтандартныйПериод -
	Организация = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(
		КомпоновщикНастроек.ПользовательскиеНастройки, "Организация").Значение; // СправочникСсылка.Организации -
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	ПараметрыРасчета = УчетНДСУПСлужебный.ИнициализироватьПараметрыПодготовкиРасчетовАвансовВЦеляхНДС();
	
	ПараметрыРасчета.ДатаНачала                    = ПериодОтбора.ДатаНачала;
	ПараметрыРасчета.ДатаОкончания                 = ПериодОтбора.ДатаОкончания;
	ПараметрыРасчета.Организации                   = Организация;
	
	УчетНДСУПСлужебный.ПодготовитьВТ_АвансыПолученные_Погашения(МВТ, ПараметрыРасчета);
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("ДатаНачала",    ПериодОтбора.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодОтбора.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаОкончанияВключая",
		?(ЗначениеЗаполнено(ПериодОтбора.ДатаОкончания), Новый Граница(ПериодОтбора.ДатаОкончания, ВидГраницы.Включая), Неопределено));
	Запрос.УстановитьПараметр("Организация",   Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НДСАвансы.Организация КАК Организация,
	|	НДСАвансы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НДСАвансы.Контрагент КАК Контрагент,
	|	НДСАвансы.ОбъектРасчетов КАК ОбъектРасчетов,
	|	НДСАвансы.ДокументОплаты КАК ДокументОплаты,
	|	НДСАвансы.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|	НДСАвансы.СтавкаНДС.Ставка КАК СтавкаНДС,
	|	НДСАвансы.ДокументЗачетаАванса КАК ДокументЗачетаАванса,
	|	НДСАвансы.СуммаАванса КАК СуммаАванса,
	|	НДСАвансы.НачислениеНДС КАК НачислениеНДС,
	|	НДСАвансы.СписаниеНДССАванса КАК СписаниеНДССАванса,
	|	НДСАвансы.СуммаЗачета КАК СуммаЗачета,
	|	НДСАвансы.СуммаВычетаНДС КАК СуммаВычетаНДС,
	|	НДСАвансы.ОстатокНДСНачало КАК ОстатокНДСНачало,
	|	НДСАвансы.ОстатокНДСКонец КАК ОстатокНДСКонец
	|ПОМЕСТИТЬ втОстаткиИОборотыНДССАвансов
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДСАвансы.Организация КАК Организация,
	|		НДСАвансы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		НДСАвансы.Контрагент КАК Контрагент,
	|		НДСАвансы.ОбъектРасчетов КАК ОбъектРасчетов,
	|		НДСАвансы.ДокументОплаты КАК ДокументОплаты,
	|		НДСАвансы.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|		НДСАвансы.СтавкаНДС КАК СтавкаНДС,
	|		НДСАвансы.ДокументЗачетаАванса КАК ДокументЗачетаАванса,
	|		ВЫБОР
	|			КОГДА НДСАвансы.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.НачислениеСПолученногоАванса)
	|				ТОГДА НДСАвансы.СуммаБезНДС + НДСАвансы.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаАванса,
	|		ВЫБОР
	|			КОГДА НДСАвансы.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.НачислениеСПолученногоАванса)
	|				ТОГДА НДСАвансы.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НачислениеНДС,
	|		ВЫБОР
	|			КОГДА НДСАвансы.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.СписаниеНДССПолученногоАванса)
	|				ТОГДА НДСАвансы.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СписаниеНДССАванса,
	|		ВЫБОР
	|			КОГДА НДСАвансы.Событие В (ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.ВычетПриЗачетеАванса), ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.ВычетПриВозвратеАванса))
	|				ТОГДА НДСАвансы.СуммаБезНДС + НДСАвансы.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаЗачета,
	|		ВЫБОР
	|			КОГДА НДСАвансы.Событие В (ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.ВычетПриЗачетеАванса), ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.ВычетПриВозвратеАванса))
	|				ТОГДА НДСАвансы.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаВычетаНДС,
	|		0 КАК ОстатокНДСНачало,
	|		0 КАК ОстатокНДСКонец
	|	ИЗ
	|		РегистрНакопления.НДСАвансыПолученные КАК НДСАвансы
	|	ГДЕ
	|		НДСАвансы.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		И НДСАвансы.Организация = &Организация
	|		И НДСАвансы.Активность = ИСТИНА
	|		И НДСАвансы.Событие В (ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.НачислениеСПолученногоАванса), ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.СписаниеНДССПолученногоАванса), ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.ВычетПриЗачетеАванса), ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.ВычетПриВозвратеАванса))
	|		И НДСАвансы.НДС <> 0
	|		И НДСАвансы.НастройкаХозяйственнойОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПереносАванса)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиАвансов.Организация,
	|		ОстаткиАвансов.НаправлениеДеятельности,
	|		ОстаткиАвансов.Контрагент,
	|		ОстаткиАвансов.ОбъектРасчетов,
	|		ОстаткиАвансов.ДокументОплаты,
	|		ОстаткиАвансов.ИсправленныйСчетФактура,
	|		ОстаткиАвансов.СтавкаНДС,
	|		НЕОПРЕДЕЛЕНО,
	|		ОстаткиАвансов.СуммаБезНДСОстаток + ОстаткиАвансов.НДСОстаток,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ОстаткиАвансов.НДСОстаток,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСАвансыПолученные.Остатки(&ДатаНачала, Организация = &Организация) КАК ОстаткиАвансов
	|	ГДЕ
	|		ОстаткиАвансов.НДСОстаток <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиАвансов.Организация,
	|		ОстаткиАвансов.НаправлениеДеятельности,
	|		ОстаткиАвансов.Контрагент,
	|		ОстаткиАвансов.ОбъектРасчетов,
	|		ОстаткиАвансов.ДокументОплаты,
	|		ОстаткиАвансов.ИсправленныйСчетФактура,
	|		ОстаткиАвансов.СтавкаНДС,
	|		НЕОПРЕДЕЛЕНО,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ОстаткиАвансов.НДСОстаток
	|	ИЗ
	|		РегистрНакопления.НДСАвансыПолученные.Остатки(&ДатаОкончанияВключая, Организация = &Организация) КАК ОстаткиАвансов
	|	ГДЕ
	|		ОстаткиАвансов.НДСОстаток <> 0) КАК НДСАвансы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновнаяТаблица.Организация КАК Организация,
	|	ОсновнаяТаблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОсновнаяТаблица.Контрагент КАК Контрагент,
	|	ОсновнаяТаблица.ДокументОплаты КАК ДокументОплаты,
	|	ОсновнаяТаблица.ОбъектРасчетов КАК ОбъектРасчетов
	|ПОМЕСТИТЬ втОсновнаяТаблица
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДСАвансы.Организация КАК Организация,
	|		НДСАвансы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		НДСАвансы.Контрагент КАК Контрагент,
	|		НДСАвансы.ДокументОплаты КАК ДокументОплаты,
	|		НДСАвансы.ОбъектРасчетов КАК ОбъектРасчетов
	|	ИЗ
	|		втОстаткиИОборотыНДССАвансов КАК НДСАвансы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗачетыПоВзаиморасчетам.Организация,
	|		ЗачетыПоВзаиморасчетам.НаправлениеДеятельности,
	|		ЗачетыПоВзаиморасчетам.Контрагент,
	|		ЗачетыПоВзаиморасчетам.РасчетныйДокумент,
	|		ЗачетыПоВзаиморасчетам.ОбъектРасчетов
	|	ИЗ
	|		АвансыПолученные_Погашения КАК ЗачетыПоВзаиморасчетам
	|	ГДЕ
	|		(ЗачетыПоВзаиморасчетам.РасчетныйДокумент, ЗачетыПоВзаиморасчетам.Организация) В
	|				(ВЫБРАТЬ
	|					Т.ДокументОснование,
	|					Т.Организация
	|				ИЗ
	|					Документ.СчетФактураВыданныйАванс КАК Т
	|				ГДЕ
	|					Т.Проведен)) КАК ОсновнаяТаблица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактура.ДокументОснование КАК ДокументОснование,
	|	СчетФактура.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ПОДСТРОКА(СчетФактура.НомерИсправления, 2, 1) КАК СТРОКА(1))) = """"
	|			ТОГДА ВЫРАЗИТЬ(""0"" + СчетФактура.НомерИсправления КАК СТРОКА(3))
	|		ИНАЧЕ ВЫРАЗИТЬ(СчетФактура.НомерИсправления КАК СТРОКА(3))
	|	КОНЕЦ КАК НомерИсправленияДляСортировки
	|ПОМЕСТИТЬ втСчетаФактуры
	|ИЗ
	|	Документ.СчетФактураВыданныйАванс КАК СчетФактура
	|ГДЕ
	|	(СчетФактура.ДокументОснование, СчетФактура.Организация) В
	|			(ВЫБРАТЬ
	|				Т.ДокументОплаты,
	|				Т.Организация
	|			ИЗ
	|				втОсновнаяТаблица КАК Т)
	|	И СчетФактура.Дата <= &ДатаОкончания
	|	И СчетФактура.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаФактурыПоследние.ДокументОснование КАК ДокументОснование,
	|	СчетФактура.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактура.НомерИсправленияДляСортировки = """"
	|				ИЛИ СчетФактура.НомерИсправленияДляСортировки = ""0""
	|			ТОГДА ЗНАЧЕНИЕ(Документ.СчетФактураВыданныйАванс.ПустаяСсылка)
	|		ИНАЧЕ СчетФактура.Ссылка
	|	КОНЕЦ КАК ИсправленныйСчетФактура
	|ПОМЕСТИТЬ втСчетаФактурыПоследние
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.ДокументОснование КАК ДокументОснование,
	|		МАКСИМУМ(Т.НомерИсправленияДляСортировки) КАК НомерИсправленияДляСортировки
	|	ИЗ
	|		втСчетаФактуры КАК Т
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Т.ДокументОснование) КАК СчетаФактурыПоследние
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаФактуры КАК СчетФактура
	|		ПО СчетаФактурыПоследние.ДокументОснование = СчетФактура.ДокументОснование
	|			И СчетаФактурыПоследние.НомерИсправленияДляСортировки = СчетФактура.НомерИсправленияДляСортировки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновнаяТаблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОсновнаяТаблица.Контрагент КАК Контрагент,
	|	ОсновнаяТаблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОсновнаяТаблица.ДокументОплаты КАК ДокументОплаты,
	|	СчетаФактуры.Ссылка КАК СчетФактура
	|ИЗ
	|	втОсновнаяТаблица КАК ОсновнаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСчетаФактурыПоследние КАК СчетаФактуры
	|		ПО ОсновнаяТаблица.ДокументОплаты = СчетаФактуры.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСАвансы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НДСАвансы.Контрагент КАК Контрагент,
	|	НДСАвансы.ОбъектРасчетов КАК ОбъектРасчетов,
	|	НДСАвансы.ДокументОплаты КАК ДокументОплаты,
	|	НДСАвансы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(НДСАвансы.СуммаАванса) КАК СуммаАванса,
	|	СУММА(НДСАвансы.НачислениеНДС) КАК НачислениеНДС,
	|	СУММА(НДСАвансы.СписаниеНДССАванса) КАК СписаниеНДССАванса,
	|	СУММА(НДСАвансы.ОстатокНДСНачало) КАК ОстатокНДСНачало,
	|	СУММА(НДСАвансы.ОстатокНДСКонец) КАК ОстатокНДСКонец
	|ИЗ
	|	втОстаткиИОборотыНДССАвансов КАК НДСАвансы
	|ГДЕ
	|	(НДСАвансы.ДокументОплаты, НДСАвансы.ИсправленныйСчетФактура) В
	|			(ВЫБРАТЬ
	|				СчетаФактуры.ДокументОснование,
	|				СчетаФактуры.ИсправленныйСчетФактура
	|			ИЗ
	|				втСчетаФактурыПоследние КАК СчетаФактуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСАвансы.НаправлениеДеятельности,
	|	НДСАвансы.Контрагент,
	|	НДСАвансы.ДокументОплаты,
	|	НДСАвансы.СтавкаНДС,
	|	НДСАвансы.ОбъектРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСАвансы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НДСАвансы.Контрагент КАК Контрагент,
	|	НДСАвансы.ОбъектРасчетов КАК ОбъектРасчетов,
	|	НДСАвансы.ДокументОплаты КАК ДокументОплаты,
	|	НДСАвансы.ДокументЗачетаАванса КАК ДокументЗачетаАванса,
	|	НДСАвансы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(НДСАвансы.СуммаЗачета) КАК СуммаЗачета_Детализированная,
	|	СУММА(НДСАвансы.СуммаВычетаНДС) КАК СуммаВычетаНДС
	|ИЗ
	|	втОстаткиИОборотыНДССАвансов КАК НДСАвансы
	|ГДЕ
	|	(НДСАвансы.ДокументОплаты, НДСАвансы.ИсправленныйСчетФактура) В
	|			(ВЫБРАТЬ
	|				СчетаФактуры.ДокументОснование,
	|				СчетаФактуры.ИсправленныйСчетФактура
	|			ИЗ
	|				втСчетаФактурыПоследние КАК СчетаФактуры)
	|	И НДСАвансы.СуммаВычетаНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСАвансы.НаправлениеДеятельности,
	|	НДСАвансы.Контрагент,
	|	НДСАвансы.ДокументОплаты,
	|	НДСАвансы.ДокументЗачетаАванса,
	|	НДСАвансы.СтавкаНДС,
	|	НДСАвансы.ОбъектРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачетыАвансов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗачетыАвансов.Контрагент КАК Контрагент,
	|	ЗачетыАвансов.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ЗачетыАвансов.РасчетныйДокумент КАК ДокументОплаты,
	|	СУММА(ЗачетыАвансов.СуммаПогашения) КАК СуммаЗачета_Общая
	|ИЗ
	|	АвансыПолученные_Погашения КАК ЗачетыАвансов
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗачетыАвансов.НаправлениеДеятельности,
	|	ЗачетыАвансов.Контрагент,
	|	ЗачетыАвансов.РасчетныйДокумент,
	|	ЗачетыАвансов.ОбъектРасчетов";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка1 =  ПакетРезультатов[ПакетРезультатов.Количество() - 4].Выбрать();
	Выборка2 =  ПакетРезультатов[ПакетРезультатов.Количество() - 3].Выбрать();
	Выборка3 =  ПакетРезультатов[ПакетРезультатов.Количество() - 2].Выбрать();
	Выборка4 =  ПакетРезультатов[ПакетРезультатов.Количество() - 1].Выбрать();
	
	СтруктураНаборовДанных.Вставить("ОсновнаяТаблица",               Выборка1);
	СтруктураНаборовДанных.Вставить("ОстаткиИОборотыНДССАвансов",    Выборка2);
	СтруктураНаборовДанных.Вставить("Зачеты_НДССАвансов",            Выборка3);
	СтруктураНаборовДанных.Вставить("Зачеты_ПоДаннымВзаиморасчетов", Выборка4);
	
	
	Возврат СтруктураНаборовДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
